EX161: PROC OPTIONS (MAIN);                                                     |
CALL EX162();                                                                   |
END  EX161;                                                                     |
