EX1: PROC OPTIONS(MAIN);                                                      
DCL A BIN FIXED(31) INIT(3);                                                  
DCL B BIN FIXED(31) INIT(4);                                                  
DCL C BIN FIXED(31) INIT(5);                                                  
DCL D BIN FIXED(31);                                                          
D=A+B-C;                                                                      
END EX1;                                                                      